tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# CLI apps
brew "asciinema"
brew "asdf"
brew "ansible"
brew "awscli"
brew "bat"
brew "bpytop"
brew "guile"
brew "gnutls"
brew "cask"
brew "cfssl"
brew "cowsay"
brew "diff-so-fancy"
brew "fzf"
brew "git"
brew "glow"
brew "helm"
brew "htop"
brew "httpie"
brew "kubernetes-cli"
brew "kubectx"
brew "mas"
brew "mcfly"
brew "terraform"
brew "thefuck"
brew "tldr"
brew "tree"
brew "wget"
brew "zlib"
brew "zsh"

# Casks (GUI Apps)
cask "alfred"
cask "authy"
cask "bartender"
cask "fig"
cask "hyper"
cask "rectangle"
cask "skitch"
cask "vlc"
cask "visual-studio-code"

# Fonts
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"
cask "homebrew/cask-fonts/font-meslo-lg-nerd-font"

# Mac App Store Apps
mas "Amphetamine", id: 937984704
mas "Trello", id: 1278508951
mas "Kindle", id: 405399194
mas "Gestimer", id: 990588172
mas "Microsoft Remote Desktop", id: 1295203466
mas "ToothFairy", id: 1191449274
